SQL BOLT

Interactive Tutorial

https://sqlbolt.com/

Learning SQL with simple, and interactive exercises


Table of Contents

1. SELECT queries
2. Queries with constraints (Pt. 1))
3. Queries with constraints (Pt. 2))
4. Filtering and sorting Query results
5. Simple SELECT Queries Review
6. Multi-table queries with JOINs
7. OUTER JOINs
8. A short note on NULLs
9. Queries with expressions
10. Queries with aggregates (Pt. 1))
11. Queries with aggregates (Pt. 2))
12. Order of execution of a Query
13. Inserting rows
14. Updating rows
15. Deleting rows
16. Creating tables
17. Altering tables
18. Dropping tables
19. Subqueries
20. Unions, Intersections & Exceptions

In [ ]:

# SQL Lesson 1: SELECT QUERIES 
# EXERCISE 1 -- Tasks


# Task 1: Find the title of each movie
SELECT title FROM movies;

# Task 2: Find the director of each film
SELECT director
FROM movies;

# Task 3: Find the title and director of each film
SELECT director, title
FROM movies;

# Task 4: Find the title and year of each film
SELECT title, year
FROM movies;

# Task 5: Find all the information about each film
SELECT * FROM movies;

In [ ]:
# SQL Lesson 2: Queries with constraints (Pt. 1)
# EXERCISE 2 -- Tasks

|       Operator      |       Condition                                      |       SQL Example               |
| ------------------- | ---------------------------------------------------- | ------------------------------- |
| =, !=, <, <=, >, >= | Standard numerical operators                         | `col_name != 4`                 |
| BETWEEN … AND …     | Number is within range of two values (inclusive)     | `col_name BETWEEN 1.5 AND 10.5` |
| NOT BETWEEN … AND … | Number is not within range of two values (inclusive) | `col_name NOT BETWEEN 1 AND 10` |
| IN (…)              | Number exists in a list                              | `col_name IN (2, 4, 6)`         |
| NOT IN (…)          | Number does not exist in a list                      | `col_name NOT IN (1, 3, 5)`     |


# Task 1:  Find the movie with a row id of 6
SELECT *
FROM movies
    WHERE id = 6;

# Task 2: Find the movies release in the year between 2000 and 2010
SELECT *
FROM movies
    WHERE year BETWEEN 2000 AND 2010;

# Task 3: Find the movies not released in the years between 2000 and 2010
SELECT *
FROM movies
    WHERE year NOT BETWEEN 2000 AND 2010;

# Task 4: Find the first 5 pixar movies and their relase year
SELECT title, year
FROM movies
    LIMIT 5;

In [ ]:
# SQL Lesson 3: Queries with constraints (Pt. 2)
# EXERCISE 3 --- Tasks


|     Operator | Condition                                            |   SQL Example                     |
| ------------ | ---------------------------------------------------- | --------------------------------- |
| =            | Case sensitive exact string comparison               | `col_name = "abc"`                |
| != or < >    | Case sensitive exact string inequality comparison    | `col_name != "abcd"`              |
| LIKE         | Case insensitive exact string comparison             | `col_name LIKE "ABC"`             |
| NOT LIKE     | Case insensitive exact string inequality comparison  | `col_name NOT LIKE "ABCD"`        |
| %            | Matches zero or more characters (with LIKE/NOT LIKE) | `col_name LIKE "%AT%"`            |
| _            | Matches exactly one character (with LIKE/NOT LIKE)   | `col_name LIKE "AN_"`             |
| IN (…)       | String exists in a list                              | `col_name IN ("A", "B", "C")`     |
| NOT IN (…)   | String does not exist in a list                      | `col_name NOT IN ("D", "E", "F")` |


# Task 1: Find all the Toy Story movies
SELECT *
FROM movies
    WHERE title LIKE 'Toy Story%';

# Task 2: Find all the movies directed by John Lasseter
SELECT *
FROM movies
    WHERE Director = 'John Lasseter';

# Task 3: Find all the movies (and director) not directed by John Lasseter
SELECT Title, Director
FROM movies
    WHERE Director != 'John Lasseter';

# Task 4: Find all the WALL-* movies
SELECT *
FROM movies
    WHERE Title LIKE 'WALL-_';

In [ ]:
# SQL LESSON 4: Filtering and sorting Query results
# EXERCISE 4 -- Tasks


# Task 1: List all directors of Pixar movies (alphabetically), without duplicates
SELECT DISTINCT Director
    FROM movies
    ORDER BY Director;

# Task 2: List the last four Pixar movies released (ordered from most recent to least)
SELECT *
    FROM movies
    ORDER BY year DESC
    LIMIT 4 OFFSET 4;

# Task 3: List the first five Pixar movies sorted alphabetically 
SELECT * 
    FROM movies
    ORDER BY Title ASC
    LIMIT 5;

# Task 4: List the next five Pixar movies sorted alphabetically
SELECT *
    FROM movies
    ORDER BY Title ASC
    LIMIT 5 OFFSET 5;

In [ ]:
# SQL Reviews: Simple SELECT Queries

# Review Task 1: List all the Canadian cities and their populations
SELECT City, Population 
FROM North_american_cities
    WHERE Country = 'Canada';

# Review Task 2: Order all the cities in the United States by their latitude from north to south
SELECT City
FROM North_american_cities
    WHERE Country LIKE 'United S%s'
    ORDER BY Latitude DESC;

# Review Task 3: List all the cities west of Chicago, ordered from west to east
SELECT City
FROM North_american_citites
    WHERE Longitude < -87.629798
ORDER BY Longitude;

# Review Task 4: List the two largest cities in Mexico (by population)
SELECT City
FROM North_american_cities
    WHERE Country = "Mexico"
    ORDER BY Population DESC
    LIMIT 2;

# Review Task 5: List the third and fourth largest cities (by population)
# in the United States and their population
SELECT City, Population
FROM North_american_cities
    WHERE Country = 'United States'
    ORDER BY Population DESC
    LIMIT 2 OFFSET 2;

In [ ]:
# SQL LESSON 6: Multi-table qureis with JOINs
# EXERCISE 6 -- Tasks


#Task 1: Find the domestic and international sales for each movie
SELECT Title, Domestic_sales, International_sales
FROM Movies
    INNER JOIN BoxOffice
    ON Movies.Id = BoxOffice.Movie_id;

#Task 2: Show the sales numbers for each movie that did better internationally rather than domestically
SELECT Title, Domestic_sales, International_sales
FROM Movies
    INNER JOIN BoxOffice
    ON Movies.Id = BoxOffice.Movie_id
    WHERE BoxOffice.International_sales > BoxOffice.Domestic_sales;

# Tasl 3: List all movies by their ratings in descending order
SELECT Title, Rating
FROM Movies
    INNER JOIN BoxOffice
    ON Movies.id = BoxOffice.movie_id
    ORDER BY BoxOffice.Rating DESC;

In [ ]:
# SQL LESSON 7: OUTER JOINs
# EXERCISE 7 -- Tasks


# Task 1: Find the list of all buildings that have employees
SELECT DISTINCT Building_name
    FROM buildings
    INNER JOIN employees
    ON buildings.building_name = employees.building


# Task 2: Find the list of all buildings and their capacity
SELECT  DISTINCT Building_name, capacity
    FROM  buildings 
    LEFT JOIN employees
    ON buildings.building_name = employees.building;

# Task 3: List all buildings and the distinct employee roles in each building (including empty buildings)
SELECT DISTINCT building_name, role 
FROM buildings 
  LEFT JOIN employees
    ON buildings.building_name = employees.building;

In [ ]:
# SQL Lesson 8: A short note on NULLs
# EXERCISE 8 -- Tasks

    # NULL means no values / missing values or unknown values
    # It is not same as 0 or empty string ''
    # we cannot check it with = or != 

# Task 1: Find the name and role of all the employees who have not been assigned to a building
SELECT Name, Role
FROM Employees
    WHERE building IS NULL;

# Task 2: Find the names of the buildings that hold no employees
SELECT Building_name, Name
FROM Buildings
    LEFT JOIN Employees
    ON Buildings.Building_name = Employees.Building
    WHERE Employees.Name IS NULL;

In [ ]:
# SQL LESSON 9: Queries with expression
# Exercise 9 -- Tasks

    # Expression let us transform or calculate column values with quering
    # Can include arithmetic operations, string operations or functions
    # Arithmetic `Salary * 1.10 --> increase salary by 10%`
    # function slike UPPER(name), LOWER(name), round, sum and more


# Task 1: List all movies and their combined sales in millions of dollars
SELECT Title, (Domestic_sales + international_sales)/ 1000000 AS combined_sales
    FROM Movies
    LEFT JOIN BoxOffice
    ON Movies.id = BoxOffice.movie_id;


# Task 2: List all movies and their ratings in percent
SELECT Title, (Rating * 10) AS rating_percent
    FROM Movies
    LEFT JOIN BoxOffice
    ON Movies.id = BoxOffice.movie_id;

# Task 3: List all movies that were released on even number years
SELECT Title
FROM Movies
    WHERE year % 2 = 0;

In [ ]:
# SQL Lesson 10: Queries with aggregates (Pt. 1)
# Exercise 10 -- Tasks

# Here are some common aggregate functions that we are going to use in our examples:
| Function                    | Description                                                                                                   |
| --------------------------- | ------------------------------------------------------------------------------------------------------------- |
| `COUNT(*)`, `COUNT(column)` | Counts the number of rows in the group. If a column is specified, counts only non-NULL values in that column. |
| `MIN(column)`               | Finds the smallest numerical value in the specified column for all rows in the group.                         |
| `MAX(column)`               | Finds the largest numerical value in the specified column for all rows in the group.                          |
| `AVG(column)`               | Finds the average numerical value in the specified column for all rows in the group.                          |
| `SUM(column)`               | Finds the sum of all numerical values in the specified column for the rows in the group.                      |

# Task 1: Find the longest time that an employee has been at the studio 
SELECT MAX(Years_employed)
FROM Employees;

# Task 2: For each role, find the average number of years employed by employees in that role
SELECT Role, AVG(Years_employed)
    FROM Employees
    GROUP BY Role;

# Task 3: Find the total number of employee years worked in each building
SELECT Building, SUM(Years_employed)
FROM Employees
GROUP BY Building;

In [ ]:
# SQL Lesson 11: Queries with aggregates (Pt.2)
# Exercise 11 -- Tasks


# Task 1: Find the number of Artists in the studio (without a HAVING clause)
SELECT COUNT(Name) AS Artists
FROM Employees
WHERE Role = 'Artist';

# Task 2: Find the number of Employees of each role in the studio
SELECT COUNT(Name) AS No_of_employees, Role
FROM Employees
GROUP BY total_emp , Role

# Task 3: Find the total number of years employed by all Engineers
SELECT role, SUM(Years_employed)
    FROM Employees
    GROUP BY role
    HAVING role = 'Engineer';

In [ ]:
# SQL Lesson 12: Order of execution of a query
# Exercise 12 -- Tasks

# Execution order (what actually happens):
    # FROM & JOIN → prepare dataset
    # WHERE → filter rows
    # GROUP BY → group rows
    # HAVING → filter groups
    # SELECT → pick/compute columns
    # DISTINCT → remove duplicates
    # ORDER BY → sort results
    # LIMIT / OFFSET → return final rows

# Task 1: Find the number of movies each director has directed
SELECT Director, COUNT(Title) AS Movies
    FROM Movies
    GROUP BY Director
    ORDER BY Director;

# Task 2: Find the total domestic and international sales that can be attributed to each director
SELECT Director, SUM(Domestic_sales + international_sales) AS Total_sales
    FROM Movies
    INNer JOIN  boxoffice
    ON Movies.id = boxoffice.movie_id
    GROUP BY Movies.Director;

In [ ]:
# SQL Lesson 13: Inserting rows
# Exercise 13 -- Tasks

# Task 1: add the studio's new production, Toy Story 4 to the list of movies 
INSERT INTO Movies(Id, Title, Director, Year, Length_minutes)
    VALUES (4, 'Toy Story 4', 'John Lasseter', 2002, 98);

# Task 2: Toy Story 4 has been released to critical acclaim! It had a rating of 8.7, and made 340 million domestically and 270 million internationally. 
# Add the record to the BoxOffice table.
INSERT INTO BoxOffice
    VALUES (4, 8.7,  250000000, 270000000);

In [ ]:
# SQL Lesson 14: Updating rows
# Exercise 14 -- Tasks

# Task 1: The director for A Bug's Life is incorrect, it was actually directed by John Lasseter
UPDATE  Movies
    SET Director = 'John Lasseter'
    WHERE title  = 'A Bugs Life';

# Task 2: The year that Toy Story 2 was released is incorrect, it was actually released in 1999
UPDATE Movies
    SET Year = 1999
    WHERE title LIKE 'Toy%2';

# Task 3: Both the title and director for Toy Story 8 is incorrect! 
# The title should be "Toy Story 3" and it was directed by Lee Unkrich

UPDATE  Movies
SET title = 'Toy Story 3', director = "Lee Unkrich"
WHERE id = 11;

In [ ]:
# SQL Lesson 15: Deleting rows
# Exercise 15 -- Tasks

# Task 1: This database is getting too big, lets remove all movies that were released before 2005
DELETE FROM Movies
WHERE Year < 2005;

# Task 2: Andrew Stanton has also left the studio, so please remove all movies directed by him.
DELETE FROM Movies
WHERE Director = 'Andrew Stanton';

In [ ]:
# SQL Lesson 16: Creating tables
# Exercise 16 -- Tasks

# Task 1 Create a new table named Database with the following columns:
   `Name A string (text) describing the name of the database
    Version A number (floating point) of the latest version of this database
    Download_count An integer count of the number of times this database was downloaded`
    
CREATE TABLE Database(
Name TEXT,
Version FLOAT,
Download_count INTEGER
);

In [ ]:
# SQL Lesson 17: Altering tables
# Exercise 17 -- Tasks

# Task 1: Add a column named Aspect_ratio with a FLOAT data type to store 
# the aspect-ratio each movie was released in. 
ALTER TABLE Movies
ADD Aspect_ratio FLOAT;

# Task 2: Add another column named Language with a TEXT data type to store the language that the movie was released in.
# Ensure that the default for this language is English.
ALTER TABLE Movies
  ADD COLUMN Language TEXT DEFAULT "English";

In [ ]:
# SQL Lesson 18: Dropping tables
# Exercise 18 -- Tasks

# Task 1: delete the movies table
DROP TABLE IF EXISTS Movies

# Task 2: delte the boxoffice table
DROP TABLE IF EXISTS BoxOffice;